<?php

/**
 * Освобождение сотрудников с коммерческих проектов происходят по разным причинам, как правило это
 * завершение задач, завершение проекта, замена своим специалистом, инцидент. В этой формуле моделируется ситуация,
 * когда клиент сам по своей инициативе выводит наших специалистов с проекта (не путать с хантингом).
 *
 * От чего зависит количество освобождающихся специалистов:
 * - empl_demand - кадровые спрос на рынке, чем _выше_ значение, тем меньше _значение_ освобождающихся
 *   специалистов, логика в том, что если существует высокий спрос на кадры, тем клиентам сложнее находить
 *   ценных специалистов, поэтому они будут плотнее работать с подрядчиками; высокий спрос на кадры также
 *   означает, что в отрасли большое количество ИТ-проектов, всем нужны специалисты, поэтому клиенты
 *   идут за кадрами к подрядчикам; это ситуация 2021 года, когда был высокий спрос и аккаунты делали
 *   до 80% всех расширений в проектах.
 *   Обращаю внимание, тут мы не говорим про хантинг, этот параметр обсчитывается отдельно, тут только
 *   про освобождение специалистов с проектов по таким причинам как завершение проекта или закончились
 *   задачи; В ситуации высокого спроса задачи у клиентов не заканчиваются.
 *
 * - x_iAccount - чем _выше_ значение, т.е. больше инвестиций в аккаунтинг, тем _меньше_ значение
 *   EmplReleasedFormCommercialProjects. Смысл в том, как компании выстраивают
 *   свои отношения с клиентами, чем лучше - тем плотнее сотрудничество. При этом, если все компании
 *   инвестирую в аккаунтинг примерно одинаковые суммы, то коэффициент у всех будет низкий/одинаковый. Та же
 *   компания, которая инвестирую значительно превосходящие суммы, получит бОльшее значение x_iAccount, что
 *   уменьшит освобождение специалистов с проектов
 *
 * - x_iPE - общая эффективность производства, сервисность, качество; чем выше, тем лучше
 *   В реальности, это означает, что ЛПР клиентов довольны работой с подрядчиком и не хотят от него уходить
 */
class EmplReleasedFormCommercialProjects
{
    public static function formula(Market $market, Company $company) : int
    {
        // настроечный коэффициент
        $x = $market->factors->x_EmplReleasedFormCommercialProjects;

        // коэффициент спроса на кадры - это процент на сколько хочет вырасти рынок в кол-ве специалистов
        // чем выше - тем меньше освобождаются с проектов
        $empl_demand = $market->empl_demand;

        // количество коммерчески занятых специалистов в компании
        $empl_billable = $company->calc->empl_billable;

        // нормализованный [0..1] коэффициент инвестиций в эффективность производства
        // чем выше - тем меньше будут освобождаться с проектов
        $x_iPE = $company->calc->x_iPE;

        // нормализованный [0..1] коэффициент инвестиций в аккаунтинг
        // чем выше - тем меньше будут освобождаться с проектов
        $x_iAccount = $company->calc->x_iAccount;

        return round(
            $x * $empl_billable * (1-$empl_demand) * (1-$x_iPE) * (1-$x_iAccount)
        );

    }
}
