<?php

/**
 * Исполнение заявки на найм от компании
 * Успешность найма зависит от инвестиций в HR и от кадрового спроса на рынке empl_demand
 * Как правило, за ход будет нанято меньше, чем указано в заявке
 * Это эмуляция реальности, которая заключается в том, что наши заявки на найм могут исполняться
 * по 30-50 дней. В игре, по аналогии, также эмулируется, что "когда-то" будут наняты все по заявкам,
 * но за ход будет нанято меньше.
 * Такой подход может провоцировать игроков всегда подавать в заявке несколько большее значение к найму,
 * чем нужно. Но игра всегда берет стоимость найма (ФОТ найма) от заявки. То есть, если игрок заявил к
 * найму 20 специалистов, то оплата найма будет равна 20 зарплат. А нанято будет меньше, может быть 10
 * или около того.
 *
 * Вычисляем процент выполнения заявки, этот процент зависит инвестиций в HR и от спроса на кадры
 * Каждая заявка будет выполнена на этот процент
 * Диапазон выбора этот процента (случайный) определяется:
 * - нижняя границы равна x_iHR
 * - верхняя это x_iHR + (1-empl_demand)/4
 * Таким образом, если компания вообще не инвестирует в HR, то ее процент успешного найма
 * будет определяться от нуля до (1-empl_demand)/4, т.е. будет низким всегда
 * Такая же ситуация будет если компании инвестирую в HR примерно одинаковые суммы, хоть и большие,
 * это значит, что между ними особо нет различий в плане HR-бренда
 */
class ExecutionHiringRequest
{

    /**
     * @return array [$HireInFact, $HireCosts]
     */
    public static function formula(Market $market, Company $company) : array
    {
        // настроечный коэффициент
        $x = $market->factors->x_ExecutionHiringRequest;

        // Заявка на найм
        $order_to_hire = $company->turn->hire;

        // коэффициент спроса на кадры - это процент на сколько хочет вырасти рынок в кол-ве специалистов
        // чем выше - тем сложнее нанимать
        $empl_demand = $market->empl_demand;

        // нормализованный [0..1] коэффициент инвестиций в HR
        // чем выше - тем легче нанимать
        $x_iHR = $company->calc->x_iHR;

        $min = round($x_iHR*1000);
        $max = $min + round((1000-$empl_demand*1000)/4);
        if ($max > 1000) {
            $max = 1000;
        }
        $k = rand($min, $max) / 1000;
        $HireInFact = round($order_to_hire * $k);
        $HireCosts = $order_to_hire * $company->attr->salary;

        return [$HireInFact, $HireCosts];
    }
}
