<?php

/**
 * Класс реализует формулу хантинга (увольнения) коммерческих специалистов
 * В реальном мире, как правило, хантят именно занятых на проектах специалистов, которые хорошо себя показывают.
 * В любом случае, это потери для компании, не запланированные увольнения.
 */
class HuntingSpecialists
{

    public static function formula(Market $market, Company $company) : int
    {
        // настроечный коэффициент
        $x = $market->factors->x_HuntingSpecialists;

        // количество коммерчески занятых специалистов в компании
        $empl_billable = $company->calc->empl_billable;

        // коэффициент спроса на кадры - это процент на сколько хочет вырасти рынок в кол-ве специалистов
        // чем выше - тем больше уходят
        $empl_demand = $market->empl_demand;

        // нормализованный [0..1] коэффициент инвестиций в HR
        // чем выше - тем меньше будут уходить
        $x_iHR = $company->calc->x_iHR;

        // нормализованный [0..1] коэффициент инвестиций в эффективность производства
        // чем выше - тем меньше будут уходить
        $x_iPE = $company->calc->x_iPE;

        return round(
            $x * $empl_billable * $empl_demand * (1-$x_iHR) * (1-$x_iPE)
        );
    }
}
